Финансы 1.0/src/DataProcessors/АРМБюджет/АРМБюджет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АРМБюджет</name>
  <attributes>
    <name>Итого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоПотрачено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Затрата</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОтразить</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СтатьиЗатрат</name>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяДляРазработчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодОтражения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Финансы 1.0/src/Catalogs/СтатьиЗатрат/СтатьиЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиЗатрат</name>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляРазработчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Финансы 1.0/src/DataProcessors/АРМБюджет/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МесяцОтражения.ДатаНачала 		= НачалоМесяца(ТекущаяДатаСеанса());
	МесяцОтражения.ДатаОкончания	= КонецМесяца(ТекущаяДатаСеанса());
	ИтоговыеДанные = ИтоговыеДанныеЗаПериод(МесяцОтражения.ДатаНачала, МесяцОтражения.ДатаОкончания);
	ЗаполнитьЗначенияСвойств(Объект, ИтоговыеДанные);
	ИнициализироватьСтатьЗатрат();
	
	ЗаполнитьСписокВыбораСтатейЗатрат();
			
	МодификацияФормСервер.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	//ТЕСТ
	ВидРасходаТест = Справочники.СтатьиЗатрат.НайтиПоНаименованию("ТЕСТ");
	ОстатокТест = 300;
	ПотраченоТест = 500;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОстатокТестПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура МесяцОтраженияПриИзменении(Элемент)
	ИнициализироватьСтатьЗатрат();
	ИтоговыеДанные = ИтоговыеДанныеЗаПериод(МесяцОтражения.ДатаНачала, МесяцОтражения.ДатаОкончания);
	ЗаполнитьЗначенияСвойств(Объект, ИтоговыеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ЗатратаПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтразитьРасходы(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	ОтразитьРасходыСервер();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Клиент

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизита(Элемент)
	
	ИмяЭлемента = Элемент.Имя;
	ИмяСтатьи = СтрЗаменить(ИмяЭлемента, "ПолеСуммаПлан_", "");
	СтрокаСтатьи = НайтиСтрокуСтатьиЗатратКлиент(ИмяСтатьи);
	ДанныеБюджета = БюджетВызовСервера.ИнициализироватьПараметрыОтраженияБюджета();
	ЗаполнитьЗначенияСвойств(ДанныеБюджета, СтрокаСтатьи, , "СуммаФакт, СуммаПлан");
	ДанныеБюджета.СуммаПлан = СтрокаСтатьи.СуммаПлан + СтрокаСтатьи.СуммаФакт;
	ДанныеБюджета.ПериодОтражения = КонецМесяца(МесяцОтражения.ДатаОкончания);
	БюджетВызовСервера.ОтразитьИзмененияБюджета(ДанныеБюджета);
	ИтоговыеДанные = ИтоговыеДанныеЗаПериод(МесяцОтражения.ДатаНачала, МесяцОтражения.ДатаОкончания);
	ЗаполнитьЗначенияСвойств(Объект, ИтоговыеДанные);
			
КонецПроцедуры

&НаКлиенте
Функция НайтиСтрокуСтатьиЗатратКлиент(ИмяСтатьи)

	Отбор = Новый Структура("ИмяДляРазработчика", ИмяСтатьи);	
	СтрокиОтбора = Объект.СтатьиЗатрат.НайтиСтроки(Отбор);
	
	Если СтрокиОтбора.Количество() = 0 Тогда
		Ошибка = "";
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Строка = СтрокиОтбора[0];
	
	Возврат Строка;
	
КонецФункции

// Сервер

&НаСервере
Процедура ИнициализироватьСтатьЗатрат()
	
	МоментВыборки = Новый Граница(КонецМесяца(МесяцОтражения.ДатаОкончания), ВидГраницы.Включая);   
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(МесяцОтражения.ДатаНачала));
	Запрос.УстановитьПараметр("КонецПериода",  МоментВыборки);
	Запрос.УстановитьПараметр("ПериодОтражения", КонецМесяца(МесяцОтражения.ДатаОкончания));
	Запрос.Текст = "ВЫБРАТЬ
	|	СтатьиЗатрат.Ссылка КАК СтатьяЗатрат,
	|	СтатьиЗатрат.ИмяДляРазработчика КАК ИмяДляРазработчика,
	|	БюджетОбороты.ПланОборот - БюджетОбороты.ФактОборот КАК СуммаПлан,
	|	БюджетОбороты.ФактОборот КАК СуммаФакт,
	|	&ПериодОтражения КАК ПериодОтражения
	|ИЗ
	|	Справочник.СтатьиЗатрат КАК СтатьиЗатрат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Бюджет.Обороты(&НачалоПериода, &КонецПериода,,) КАК БюджетОбороты
	|		ПО БюджетОбороты.СтатьяЗатрат = СтатьиЗатрат.Ссылка
	|ГДЕ
	|	СтатьиЗатрат.НеИспользовать = ЛОЖЬ
	|	И СтатьиЗатрат.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатьиЗатрат.Наименование";
	
	Объект.СтатьиЗатрат.Загрузить(Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИтоговыеДанныеЗаПериод(ДатаНачала, ДатаОкончания)
	Возврат БюджетВызовСервера.ИтоговыеДанныеЗаПериод(ДатаНачала, ДатаОкончания);	
КонецФункции

&НаСервере
Процедура ОтразитьРасходыСервер()
	
	ДанныеОтразить  = БюджетСервер.ИнициализироватьПараметрыОтраженияБюджета();
	ДанныеОтразить.ИмяДляРазработчика 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Затрата,
		"ИмяДляРазработчика");
	ДанныеОтразить.ПериодОтражения 		= КонецМесяца(МесяцОтражения.ДатаОкончания);
	ДанныеОтразить.СтатьяЗатрат			= Объект.Затрата;
	ДанныеОтразить.СуммаФакт			= Объект.СуммаОтразить;
	БюджетСервер.ОтразитьИзмененияБюджета(ДанныеОтразить);
	
	ИтоговыеДанные = БюджетСервер.ИтоговыеДанныеЗаПериод(МесяцОтражения.ДатаНачала, МесяцОтражения.ДатаОкончания);
	ЗаполнитьЗначенияСвойств(Объект, ИтоговыеДанные);

	ИнициализироватьСтатьЗатрат();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораСтатейЗатрат()
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СтатьиЗатрат.Ссылка КАК СтатьяЗатрат
		|ИЗ
		|	Справочник.СтатьиЗатрат КАК СтатьиЗатрат
		|ГДЕ
		|	СтатьиЗатрат.ПометкаУдаления = ЛОЖЬ
		|	И СтатьиЗатрат.НеИспользовать = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтатьиЗатрат.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СтатьяЗатрат");
	Элементы.Затрата.СписокВыбора.ЗагрузитьЗначения(РезультатЗапроса);
	
КонецПроцедуры

#КонецОбласти
